{
    "navigation": {
        "about": "O mnie",
        "technologies": "Technologie",
        "projects": "Projekty",
        "contact": "Kontakt"
    },
    "fox": {
        "header": "Kamil Wyszyński",
        "subheader": "Junior Front-end Developer",
        "alt": "Lis"
    },
    "about": {
        "title": "O mnie",
        "description": "Cześć, jestem Kamil i pochodzę z Białegostoku. Programowaniem zainteresowałem się w 2020 roku i rozwijam tę pasję do dzisiaj. Poświęcam na naukę każdą wolną chwilę, a ponieważ sprawia mi to przyjemność, to chciałbym żeby stało się to również moją pracą. Zdecydowałem się na naukę Front-endu, ponieważ zwracam dużą uwagę na wygląd stron internetowych i lubię widzieć efekty swoich działań. Do tworzenia projektów najczęściej używam React, ale za każdym razem staram się wykorzystać coś nowego, żeby jak najwięcej się nauczyć. Chciałbym podjąć pracę jako Junior Front-end Developer.",
        "alt": "Ja w alpach"
    },
    "technologies": {
        "title": "Technologie z których korzystam"
    },
    "projects": {
        "title": "Moje projekty",
        "buttonGithub": "Github",
        "buttonLive": "Strona",
        "saper": {
            "title": "Saper",
            "description": "Moja wersja popularnej gry z początku lat 80, którą zna chyba każdy. Do wyboru są 2 poziomy trudności, które różnią się wielkością planszy i ilością bomb. Dodatkowym czynnikiem jest upływający czas.",
            "stack": "HTML, SCSS, JavaScript"
        },
        "quiz": {
            "title": "Quiz",
            "description": "Szybka zabawa na temat znajomości historii. Ten quiz polega na tym, by odgadnąć wszystkich polskich prezydentów. Jedyną podpowiedzą są lata w których dany prezydent urzędował. Jest to pierwszy projekt napisany prze ze mnie w React.",
            "stack": "React, SCSS"
        },
        "top5": {
            "title": "Top 5 leagues",
            "description": "Jako że lubię sport, w moim portfolio nie mogło zabraknąć piłkarskiej aplikacji. Na tej stronie znajdziesz aktualne tabele ligowe, najlepszych strzelców oraz skróty ostatnich meczów z 5 najlepszych lig europejskich. Dane pobrałem z 2 różnych API.",
            "stack": "React, React Router, REST API, SCSS"
        },
        "wtyker": {
            "title": "Wtyker",
            "description": "Projekt nieistniejącego sklepu internetowego z elektroniką. Można w nim filtrować oraz sortować produkty, dodawać je do koszyka, a także złożyć zamówienie.",
            "stack": "React, React Router, Redux, Styled Components"
        },
        "portfolio": {
            "title": "To portolio",
            "description": "Strona na której właśnie się znajdujesz. Prezentuję na niej swoje umiejętności oraz ukończone projekty.",
            "stack": "React, Context API, Bootstrap, EmailJS, Formik, Yup, SCSS"
        }
    },
    "contact": {
        "writeMe": {
            "title": "Napisz do mnie",
            "subtitle": "Wypełnij formularz żeby się ze mną skontaktować.",
            "subtitleSending": "Wysyłanie...",
            "subtitleSuccess": "Twoja wiadomość została wysłana. Dziękuję!",
            "subtitleError": "Uuups! Coś poszło nie tak...",
            "emailInput": "Email",
            "nameInput": "Imię",
            "messageInput": "Wiadomość",
            "emailError": "Wpisz swój adres email",
            "emailIncorrect": "Podany email jest nieprawidłowy",
            "nameError": "Wpisz swoje imię",
            "messageError": "Nie wstydź się, przynajmniej się przywitaj :)",
            "buttonMessage": "Wyślij wiadomość"
        },
        "contactInformations": {
            "title": "Informacje kontaktowe",
            "subtitle": "Dowiedz się o mnie więcej lub skontaktuj się w inny sposób."
        }
    }
    
}